digithings-GmbH/digithingsSTM32F302Sample/SW/DigithingsSTM32F302Sample/EmbSrc/Src/STM32F302_Gen/STM32F302_CAN_SCE_Def.h
// Base Addres of CAN_SCE = 0x40006400

#define STM32F302_CAN_SCE_MCR_RESET_VALUE 0x00010002
typedef struct {
    unsigned long INRQ : 1;
    unsigned long SLEEP : 1;
    unsigned long TXFP : 1;
    unsigned long RFLM : 1;
    unsigned long NART : 1;
    unsigned long AWUM : 1;
    unsigned long ABOM : 1;
    unsigned long TTCM : 1;
    unsigned long Res0 : 7;
    unsigned long RESET : 1;
    unsigned long DBF : 1;
    unsigned long Res1 : 15;
} sSTM32F302_CAN_SCE_MCR;

typedef union {
    sSTM32F302_CAN_SCE_MCR Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_MCR;

#define STM32F302_CAN_SCE_MSR_RESET_VALUE 0x00000C02
typedef struct {
    unsigned long INAK : 1;
    unsigned long SLAK : 1;
    unsigned long ERRI : 1;
    unsigned long WKUI : 1;
    unsigned long SLAKI : 1;
    unsigned long Res0 : 3;
    unsigned long TXM : 1;
    unsigned long RXM : 1;
    unsigned long SAMP : 1;
    unsigned long RX : 1;
    unsigned long Res1 : 20;
} sSTM32F302_CAN_SCE_MSR;

typedef union {
    sSTM32F302_CAN_SCE_MSR Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_MSR;

#define STM32F302_CAN_SCE_TSR_RESET_VALUE 0x1C000000
typedef struct {
    unsigned long RQCP0 : 1;
    unsigned long TXOK0 : 1;
    unsigned long ALST0 : 1;
    unsigned long TERR0 : 1;
    unsigned long Res0 : 3;
    unsigned long ABRQ0 : 1;
    unsigned long RQCP1 : 1;
    unsigned long TXOK1 : 1;
    unsigned long ALST1 : 1;
    unsigned long TERR1 : 1;
    unsigned long Res1 : 3;
    unsigned long ABRQ1 : 1;
    unsigned long RQCP2 : 1;
    unsigned long TXOK2 : 1;
    unsigned long ALST2 : 1;
    unsigned long TERR2 : 1;
    unsigned long Res2 : 3;
    unsigned long ABRQ2 : 1;
    unsigned long CODE : 2;
    unsigned long TME0 : 1;
    unsigned long TME1 : 1;
    unsigned long TME2 : 1;
    unsigned long LOW0 : 1;
    unsigned long LOW1 : 1;
    unsigned long LOW2 : 1;
} sSTM32F302_CAN_SCE_TSR;

typedef union {
    sSTM32F302_CAN_SCE_TSR Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_TSR;

#define STM32F302_CAN_SCE_RF0R_RESET_VALUE 0x00000000
typedef struct {
    unsigned long FMP0 : 2;
    unsigned long Res0 : 1;
    unsigned long FULL0 : 1;
    unsigned long FOVR0 : 1;
    unsigned long RFOM0 : 1;
    unsigned long Res1 : 26;
} sSTM32F302_CAN_SCE_RF0R;

typedef union {
    sSTM32F302_CAN_SCE_RF0R Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_RF0R;

#define STM32F302_CAN_SCE_RF1R_RESET_VALUE 0x00000000
typedef struct {
    unsigned long FMP1 : 2;
    unsigned long Res0 : 1;
    unsigned long FULL1 : 1;
    unsigned long FOVR1 : 1;
    unsigned long RFOM1 : 1;
    unsigned long Res1 : 26;
} sSTM32F302_CAN_SCE_RF1R;

typedef union {
    sSTM32F302_CAN_SCE_RF1R Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_RF1R;

#define STM32F302_CAN_SCE_IER_RESET_VALUE 0x00000000
typedef struct {
    unsigned long TMEIE : 1;
    unsigned long FMPIE0 : 1;
    unsigned long FFIE0 : 1;
    unsigned long FOVIE0 : 1;
    unsigned long FMPIE1 : 1;
    unsigned long FFIE1 : 1;
    unsigned long FOVIE1 : 1;
    unsigned long Res0 : 1;
    unsigned long EWGIE : 1;
    unsigned long EPVIE : 1;
    unsigned long BOFIE : 1;
    unsigned long LECIE : 1;
    unsigned long Res1 : 3;
    unsigned long ERRIE : 1;
    unsigned long WKUIE : 1;
    unsigned long SLKIE : 1;
    unsigned long Res2 : 14;
} sSTM32F302_CAN_SCE_IER;

typedef union {
    sSTM32F302_CAN_SCE_IER Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_IER;

#define STM32F302_CAN_SCE_ESR_RESET_VALUE 0x00000000
typedef struct {
    unsigned long EWGF : 1;
    unsigned long EPVF : 1;
    unsigned long BOFF : 1;
    unsigned long Res0 : 1;
    unsigned long LEC : 3;
    unsigned long Res1 : 9;
    unsigned long TEC : 8;
    unsigned long REC : 8;
} sSTM32F302_CAN_SCE_ESR;

typedef union {
    sSTM32F302_CAN_SCE_ESR Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_ESR;

#define STM32F302_CAN_SCE_BTR_RESET_VALUE 0x01230000
typedef struct {
    unsigned long BRP : 10;
    unsigned long Res0 : 6;
    unsigned long TS1 : 4;
    unsigned long TS2 : 3;
    unsigned long Res1 : 1;
    unsigned long SJW : 2;
    unsigned long Res2 : 4;
    unsigned long LBKM : 1;
    unsigned long SILM : 1;
} sSTM32F302_CAN_SCE_BTR;

typedef union {
    sSTM32F302_CAN_SCE_BTR Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_BTR;

#define STM32F302_CAN_SCE_TI0R_RESET_VALUE 0x00000000
typedef struct {
    unsigned long TXRQ : 1;
    unsigned long RTR : 1;
    unsigned long IDE : 1;
    unsigned long EXID : 18;
    unsigned long STID : 11;
} sSTM32F302_CAN_SCE_TI0R;

typedef union {
    sSTM32F302_CAN_SCE_TI0R Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_TI0R;

#define STM32F302_CAN_SCE_TDT0R_RESET_VALUE 0x00000000
typedef struct {
    unsigned long DLC : 4;
    unsigned long Res0 : 4;
    unsigned long TGT : 1;
    unsigned long Res1 : 7;
    unsigned long TIME : 16;
} sSTM32F302_CAN_SCE_TDT0R;

typedef union {
    sSTM32F302_CAN_SCE_TDT0R Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_TDT0R;

#define STM32F302_CAN_SCE_TDL0R_RESET_VALUE 0x00000000
typedef struct {
    unsigned long DATA0 : 8;
    unsigned long DATA1 : 8;
    unsigned long DATA2 : 8;
    unsigned long DATA3 : 8;
} sSTM32F302_CAN_SCE_TDL0R;

typedef union {
    sSTM32F302_CAN_SCE_TDL0R Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_TDL0R;

#define STM32F302_CAN_SCE_TDH0R_RESET_VALUE 0x00000000
typedef struct {
    unsigned long DATA4 : 8;
    unsigned long DATA5 : 8;
    unsigned long DATA6 : 8;
    unsigned long DATA7 : 8;
} sSTM32F302_CAN_SCE_TDH0R;

typedef union {
    sSTM32F302_CAN_SCE_TDH0R Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_TDH0R;

#define STM32F302_CAN_SCE_TI1R_RESET_VALUE 0x00000000
typedef struct {
    unsigned long TXRQ : 1;
    unsigned long RTR : 1;
    unsigned long IDE : 1;
    unsigned long EXID : 18;
    unsigned long STID : 11;
} sSTM32F302_CAN_SCE_TI1R;

typedef union {
    sSTM32F302_CAN_SCE_TI1R Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_TI1R;

#define STM32F302_CAN_SCE_TDT1R_RESET_VALUE 0x00000000
typedef struct {
    unsigned long DLC : 4;
    unsigned long Res0 : 4;
    unsigned long TGT : 1;
    unsigned long Res1 : 7;
    unsigned long TIME : 16;
} sSTM32F302_CAN_SCE_TDT1R;

