digithings-GmbH/digithingsSTM32F302Sample/SW/DigithingsSTM32F302Sample/EmbSrc/Src/STM32F302_Gen/STM32F302_CAN_SCE_Def.h
typedef union {
    sSTM32F302_CAN_SCE_TDT1R Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_TDT1R;

#define STM32F302_CAN_SCE_TDL1R_RESET_VALUE 0x00000000
typedef struct {
    unsigned long DATA0 : 8;
    unsigned long DATA1 : 8;
    unsigned long DATA2 : 8;
    unsigned long DATA3 : 8;
} sSTM32F302_CAN_SCE_TDL1R;

typedef union {
    sSTM32F302_CAN_SCE_TDL1R Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_TDL1R;

#define STM32F302_CAN_SCE_TDH1R_RESET_VALUE 0x00000000
typedef struct {
    unsigned long DATA4 : 8;
    unsigned long DATA5 : 8;
    unsigned long DATA6 : 8;
    unsigned long DATA7 : 8;
} sSTM32F302_CAN_SCE_TDH1R;

typedef union {
    sSTM32F302_CAN_SCE_TDH1R Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_TDH1R;

#define STM32F302_CAN_SCE_TI2R_RESET_VALUE 0x00000000
typedef struct {
    unsigned long TXRQ : 1;
    unsigned long RTR : 1;
    unsigned long IDE : 1;
    unsigned long EXID : 18;
    unsigned long STID : 11;
} sSTM32F302_CAN_SCE_TI2R;

typedef union {
    sSTM32F302_CAN_SCE_TI2R Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_TI2R;

#define STM32F302_CAN_SCE_TDT2R_RESET_VALUE 0x00000000
typedef struct {
    unsigned long DLC : 4;
    unsigned long Res0 : 4;
    unsigned long TGT : 1;
    unsigned long Res1 : 7;
    unsigned long TIME : 16;
} sSTM32F302_CAN_SCE_TDT2R;

typedef union {
    sSTM32F302_CAN_SCE_TDT2R Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_TDT2R;

#define STM32F302_CAN_SCE_TDL2R_RESET_VALUE 0x00000000
typedef struct {
    unsigned long DATA0 : 8;
    unsigned long DATA1 : 8;
    unsigned long DATA2 : 8;
    unsigned long DATA3 : 8;
} sSTM32F302_CAN_SCE_TDL2R;

typedef union {
    sSTM32F302_CAN_SCE_TDL2R Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_TDL2R;

#define STM32F302_CAN_SCE_TDH2R_RESET_VALUE 0x00000000
typedef struct {
    unsigned long DATA4 : 8;
    unsigned long DATA5 : 8;
    unsigned long DATA6 : 8;
    unsigned long DATA7 : 8;
} sSTM32F302_CAN_SCE_TDH2R;

typedef union {
    sSTM32F302_CAN_SCE_TDH2R Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_TDH2R;

#define STM32F302_CAN_SCE_RI0R_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 1;
    unsigned long RTR : 1;
    unsigned long IDE : 1;
    unsigned long EXID : 18;
    unsigned long STID : 11;
} sSTM32F302_CAN_SCE_RI0R;

typedef union {
    sSTM32F302_CAN_SCE_RI0R Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_RI0R;

#define STM32F302_CAN_SCE_RDT0R_RESET_VALUE 0x00000000
typedef struct {
    unsigned long DLC : 4;
    unsigned long Res0 : 4;
    unsigned long FMI : 8;
    unsigned long TIME : 16;
} sSTM32F302_CAN_SCE_RDT0R;

typedef union {
    sSTM32F302_CAN_SCE_RDT0R Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_RDT0R;

#define STM32F302_CAN_SCE_RDL0R_RESET_VALUE 0x00000000
typedef struct {
    unsigned long DATA0 : 8;
    unsigned long DATA1 : 8;
    unsigned long DATA2 : 8;
    unsigned long DATA3 : 8;
} sSTM32F302_CAN_SCE_RDL0R;

typedef union {
    sSTM32F302_CAN_SCE_RDL0R Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_RDL0R;

#define STM32F302_CAN_SCE_RDH0R_RESET_VALUE 0x00000000
typedef struct {
    unsigned long DATA4 : 8;
    unsigned long DATA5 : 8;
    unsigned long DATA6 : 8;
    unsigned long DATA7 : 8;
} sSTM32F302_CAN_SCE_RDH0R;

typedef union {
    sSTM32F302_CAN_SCE_RDH0R Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_RDH0R;

#define STM32F302_CAN_SCE_RI1R_RESET_VALUE 0x00000000
typedef struct {
    unsigned long Res0 : 1;
    unsigned long RTR : 1;
    unsigned long IDE : 1;
    unsigned long EXID : 18;
    unsigned long STID : 11;
} sSTM32F302_CAN_SCE_RI1R;

typedef union {
    sSTM32F302_CAN_SCE_RI1R Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_RI1R;

#define STM32F302_CAN_SCE_RDT1R_RESET_VALUE 0x00000000
typedef struct {
    unsigned long DLC : 4;
    unsigned long Res0 : 4;
    unsigned long FMI : 8;
    unsigned long TIME : 16;
} sSTM32F302_CAN_SCE_RDT1R;

typedef union {
    sSTM32F302_CAN_SCE_RDT1R Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_RDT1R;

#define STM32F302_CAN_SCE_RDL1R_RESET_VALUE 0x00000000
typedef struct {
    unsigned long DATA0 : 8;
    unsigned long DATA1 : 8;
    unsigned long DATA2 : 8;
    unsigned long DATA3 : 8;
} sSTM32F302_CAN_SCE_RDL1R;

typedef union {
    sSTM32F302_CAN_SCE_RDL1R Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_RDL1R;

#define STM32F302_CAN_SCE_RDH1R_RESET_VALUE 0x00000000
typedef struct {
    unsigned long DATA4 : 8;
    unsigned long DATA5 : 8;
    unsigned long DATA6 : 8;
    unsigned long DATA7 : 8;
} sSTM32F302_CAN_SCE_RDH1R;

typedef union {
    sSTM32F302_CAN_SCE_RDH1R Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_RDH1R;

#define STM32F302_CAN_SCE_FMR_RESET_VALUE 0x2A1C0E01
typedef struct {
    unsigned long FINIT : 1;
    unsigned long Res0 : 7;
    unsigned long CAN2SB : 6;
    unsigned long Res1 : 18;
} sSTM32F302_CAN_SCE_FMR;

typedef union {
    sSTM32F302_CAN_SCE_FMR Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_FMR;

#define STM32F302_CAN_SCE_FM1R_RESET_VALUE 0x00000000
typedef struct {
    unsigned long FBM0 : 1;
    unsigned long FBM1 : 1;
    unsigned long FBM2 : 1;
    unsigned long FBM3 : 1;
    unsigned long FBM4 : 1;
    unsigned long FBM5 : 1;
    unsigned long FBM6 : 1;
    unsigned long FBM7 : 1;
    unsigned long FBM8 : 1;
    unsigned long FBM9 : 1;
    unsigned long FBM10 : 1;
    unsigned long FBM11 : 1;
    unsigned long FBM12 : 1;
    unsigned long FBM13 : 1;
    unsigned long FBM14 : 1;
    unsigned long FBM15 : 1;
    unsigned long FBM16 : 1;
    unsigned long FBM17 : 1;
    unsigned long FBM18 : 1;
    unsigned long FBM19 : 1;
    unsigned long FBM20 : 1;
    unsigned long FBM21 : 1;
    unsigned long FBM22 : 1;
    unsigned long FBM23 : 1;
    unsigned long FBM24 : 1;
    unsigned long FBM25 : 1;
    unsigned long FBM26 : 1;
    unsigned long FBM27 : 1;
    unsigned long Res0 : 4;
} sSTM32F302_CAN_SCE_FM1R;

typedef union {
    sSTM32F302_CAN_SCE_FM1R Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_FM1R;

#define STM32F302_CAN_SCE_FS1R_RESET_VALUE 0x00000000
typedef struct {
    unsigned long FSC0 : 1;
    unsigned long FSC1 : 1;
    unsigned long FSC2 : 1;
    unsigned long FSC3 : 1;
    unsigned long FSC4 : 1;
    unsigned long FSC5 : 1;
    unsigned long FSC6 : 1;
    unsigned long FSC7 : 1;
    unsigned long FSC8 : 1;
    unsigned long FSC9 : 1;
    unsigned long FSC10 : 1;
    unsigned long FSC11 : 1;
    unsigned long FSC12 : 1;
    unsigned long FSC13 : 1;
    unsigned long FSC14 : 1;
    unsigned long FSC15 : 1;
    unsigned long FSC16 : 1;
    unsigned long FSC17 : 1;
    unsigned long FSC18 : 1;
    unsigned long FSC19 : 1;
    unsigned long FSC20 : 1;
    unsigned long FSC21 : 1;
    unsigned long FSC22 : 1;
    unsigned long FSC23 : 1;
    unsigned long FSC24 : 1;
    unsigned long FSC25 : 1;
    unsigned long FSC26 : 1;
    unsigned long FSC27 : 1;
    unsigned long Res0 : 4;
} sSTM32F302_CAN_SCE_FS1R;

