digithings-GmbH/digithingsSTM32F302Sample/SW/DigithingsSTM32F302Sample/EmbSrc/Src/STM32F302_Gen/STM32F302_CAN_SCE_Def.h
typedef union {
    sSTM32F302_CAN_SCE_FS1R Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_FS1R;

#define STM32F302_CAN_SCE_FFA1R_RESET_VALUE 0x00000000
typedef struct {
    unsigned long FFA0 : 1;
    unsigned long FFA1 : 1;
    unsigned long FFA2 : 1;
    unsigned long FFA3 : 1;
    unsigned long FFA4 : 1;
    unsigned long FFA5 : 1;
    unsigned long FFA6 : 1;
    unsigned long FFA7 : 1;
    unsigned long FFA8 : 1;
    unsigned long FFA9 : 1;
    unsigned long FFA10 : 1;
    unsigned long FFA11 : 1;
    unsigned long FFA12 : 1;
    unsigned long FFA13 : 1;
    unsigned long FFA14 : 1;
    unsigned long FFA15 : 1;
    unsigned long FFA16 : 1;
    unsigned long FFA17 : 1;
    unsigned long FFA18 : 1;
    unsigned long FFA19 : 1;
    unsigned long FFA20 : 1;
    unsigned long FFA21 : 1;
    unsigned long FFA22 : 1;
    unsigned long FFA23 : 1;
    unsigned long FFA24 : 1;
    unsigned long FFA25 : 1;
    unsigned long FFA26 : 1;
    unsigned long FFA27 : 1;
    unsigned long Res0 : 4;
} sSTM32F302_CAN_SCE_FFA1R;

typedef union {
    sSTM32F302_CAN_SCE_FFA1R Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_FFA1R;

#define STM32F302_CAN_SCE_FA1R_RESET_VALUE 0x00000000
typedef struct {
    unsigned long FACT0 : 1;
    unsigned long FACT1 : 1;
    unsigned long FACT2 : 1;
    unsigned long FACT3 : 1;
    unsigned long FACT4 : 1;
    unsigned long FACT5 : 1;
    unsigned long FACT6 : 1;
    unsigned long FACT7 : 1;
    unsigned long FACT8 : 1;
    unsigned long FACT9 : 1;
    unsigned long FACT10 : 1;
    unsigned long FACT11 : 1;
    unsigned long FACT12 : 1;
    unsigned long FACT13 : 1;
    unsigned long FACT14 : 1;
    unsigned long FACT15 : 1;
    unsigned long FACT16 : 1;
    unsigned long FACT17 : 1;
    unsigned long FACT18 : 1;
    unsigned long FACT19 : 1;
    unsigned long FACT20 : 1;
    unsigned long FACT21 : 1;
    unsigned long FACT22 : 1;
    unsigned long FACT23 : 1;
    unsigned long FACT24 : 1;
    unsigned long FACT25 : 1;
    unsigned long FACT26 : 1;
    unsigned long FACT27 : 1;
    unsigned long Res0 : 4;
} sSTM32F302_CAN_SCE_FA1R;

typedef union {
    sSTM32F302_CAN_SCE_FA1R Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_FA1R;

#define STM32F302_CAN_SCE_F0R1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long FB0 : 1;
    unsigned long FB1 : 1;
    unsigned long FB2 : 1;
    unsigned long FB3 : 1;
    unsigned long FB4 : 1;
    unsigned long FB5 : 1;
    unsigned long FB6 : 1;
    unsigned long FB7 : 1;
    unsigned long FB8 : 1;
    unsigned long FB9 : 1;
    unsigned long FB10 : 1;
    unsigned long FB11 : 1;
    unsigned long FB12 : 1;
    unsigned long FB13 : 1;
    unsigned long FB14 : 1;
    unsigned long FB15 : 1;
    unsigned long FB16 : 1;
    unsigned long FB17 : 1;
    unsigned long FB18 : 1;
    unsigned long FB19 : 1;
    unsigned long FB20 : 1;
    unsigned long FB21 : 1;
    unsigned long FB22 : 1;
    unsigned long FB23 : 1;
    unsigned long FB24 : 1;
    unsigned long FB25 : 1;
    unsigned long FB26 : 1;
    unsigned long FB27 : 1;
    unsigned long FB28 : 1;
    unsigned long FB29 : 1;
    unsigned long FB30 : 1;
    unsigned long FB31 : 1;
} sSTM32F302_CAN_SCE_F0R1;

typedef union {
    sSTM32F302_CAN_SCE_F0R1 Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_F0R1;

#define STM32F302_CAN_SCE_F0R2_RESET_VALUE 0x00000000
typedef struct {
    unsigned long FB0 : 1;
    unsigned long FB1 : 1;
    unsigned long FB2 : 1;
    unsigned long FB3 : 1;
    unsigned long FB4 : 1;
    unsigned long FB5 : 1;
    unsigned long FB6 : 1;
    unsigned long FB7 : 1;
    unsigned long FB8 : 1;
    unsigned long FB9 : 1;
    unsigned long FB10 : 1;
    unsigned long FB11 : 1;
    unsigned long FB12 : 1;
    unsigned long FB13 : 1;
    unsigned long FB14 : 1;
    unsigned long FB15 : 1;
    unsigned long FB16 : 1;
    unsigned long FB17 : 1;
    unsigned long FB18 : 1;
    unsigned long FB19 : 1;
    unsigned long FB20 : 1;
    unsigned long FB21 : 1;
    unsigned long FB22 : 1;
    unsigned long FB23 : 1;
    unsigned long FB24 : 1;
    unsigned long FB25 : 1;
    unsigned long FB26 : 1;
    unsigned long FB27 : 1;
    unsigned long FB28 : 1;
    unsigned long FB29 : 1;
    unsigned long FB30 : 1;
    unsigned long FB31 : 1;
} sSTM32F302_CAN_SCE_F0R2;

typedef union {
    sSTM32F302_CAN_SCE_F0R2 Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_F0R2;

#define STM32F302_CAN_SCE_F1R1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long FB0 : 1;
    unsigned long FB1 : 1;
    unsigned long FB2 : 1;
    unsigned long FB3 : 1;
    unsigned long FB4 : 1;
    unsigned long FB5 : 1;
    unsigned long FB6 : 1;
    unsigned long FB7 : 1;
    unsigned long FB8 : 1;
    unsigned long FB9 : 1;
    unsigned long FB10 : 1;
    unsigned long FB11 : 1;
    unsigned long FB12 : 1;
    unsigned long FB13 : 1;
    unsigned long FB14 : 1;
    unsigned long FB15 : 1;
    unsigned long FB16 : 1;
    unsigned long FB17 : 1;
    unsigned long FB18 : 1;
    unsigned long FB19 : 1;
    unsigned long FB20 : 1;
    unsigned long FB21 : 1;
    unsigned long FB22 : 1;
    unsigned long FB23 : 1;
    unsigned long FB24 : 1;
    unsigned long FB25 : 1;
    unsigned long FB26 : 1;
    unsigned long FB27 : 1;
    unsigned long FB28 : 1;
    unsigned long FB29 : 1;
    unsigned long FB30 : 1;
    unsigned long FB31 : 1;
} sSTM32F302_CAN_SCE_F1R1;

typedef union {
    sSTM32F302_CAN_SCE_F1R1 Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_F1R1;

#define STM32F302_CAN_SCE_F1R2_RESET_VALUE 0x00000000
typedef struct {
    unsigned long FB0 : 1;
    unsigned long FB1 : 1;
    unsigned long FB2 : 1;
    unsigned long FB3 : 1;
    unsigned long FB4 : 1;
    unsigned long FB5 : 1;
    unsigned long FB6 : 1;
    unsigned long FB7 : 1;
    unsigned long FB8 : 1;
    unsigned long FB9 : 1;
    unsigned long FB10 : 1;
    unsigned long FB11 : 1;
    unsigned long FB12 : 1;
    unsigned long FB13 : 1;
    unsigned long FB14 : 1;
    unsigned long FB15 : 1;
    unsigned long FB16 : 1;
    unsigned long FB17 : 1;
    unsigned long FB18 : 1;
    unsigned long FB19 : 1;
    unsigned long FB20 : 1;
    unsigned long FB21 : 1;
    unsigned long FB22 : 1;
    unsigned long FB23 : 1;
    unsigned long FB24 : 1;
    unsigned long FB25 : 1;
    unsigned long FB26 : 1;
    unsigned long FB27 : 1;
    unsigned long FB28 : 1;
    unsigned long FB29 : 1;
    unsigned long FB30 : 1;
    unsigned long FB31 : 1;
} sSTM32F302_CAN_SCE_F1R2;

