digithings-GmbH/digithingsSTM32F302Sample/SW/DigithingsSTM32F302Sample/EmbSrc/Src/STM32F302_Gen/STM32F302_CAN_SCE_Def.h
typedef union {
    sSTM32F302_CAN_SCE_F10R2 Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_F10R2;

#define STM32F302_CAN_SCE_F11R1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long FB0 : 1;
    unsigned long FB1 : 1;
    unsigned long FB2 : 1;
    unsigned long FB3 : 1;
    unsigned long FB4 : 1;
    unsigned long FB5 : 1;
    unsigned long FB6 : 1;
    unsigned long FB7 : 1;
    unsigned long FB8 : 1;
    unsigned long FB9 : 1;
    unsigned long FB10 : 1;
    unsigned long FB11 : 1;
    unsigned long FB12 : 1;
    unsigned long FB13 : 1;
    unsigned long FB14 : 1;
    unsigned long FB15 : 1;
    unsigned long FB16 : 1;
    unsigned long FB17 : 1;
    unsigned long FB18 : 1;
    unsigned long FB19 : 1;
    unsigned long FB20 : 1;
    unsigned long FB21 : 1;
    unsigned long FB22 : 1;
    unsigned long FB23 : 1;
    unsigned long FB24 : 1;
    unsigned long FB25 : 1;
    unsigned long FB26 : 1;
    unsigned long FB27 : 1;
    unsigned long FB28 : 1;
    unsigned long FB29 : 1;
    unsigned long FB30 : 1;
    unsigned long FB31 : 1;
} sSTM32F302_CAN_SCE_F11R1;

typedef union {
    sSTM32F302_CAN_SCE_F11R1 Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_F11R1;

#define STM32F302_CAN_SCE_F11R2_RESET_VALUE 0x00000000
typedef struct {
    unsigned long FB0 : 1;
    unsigned long FB1 : 1;
    unsigned long FB2 : 1;
    unsigned long FB3 : 1;
    unsigned long FB4 : 1;
    unsigned long FB5 : 1;
    unsigned long FB6 : 1;
    unsigned long FB7 : 1;
    unsigned long FB8 : 1;
    unsigned long FB9 : 1;
    unsigned long FB10 : 1;
    unsigned long FB11 : 1;
    unsigned long FB12 : 1;
    unsigned long FB13 : 1;
    unsigned long FB14 : 1;
    unsigned long FB15 : 1;
    unsigned long FB16 : 1;
    unsigned long FB17 : 1;
    unsigned long FB18 : 1;
    unsigned long FB19 : 1;
    unsigned long FB20 : 1;
    unsigned long FB21 : 1;
    unsigned long FB22 : 1;
    unsigned long FB23 : 1;
    unsigned long FB24 : 1;
    unsigned long FB25 : 1;
    unsigned long FB26 : 1;
    unsigned long FB27 : 1;
    unsigned long FB28 : 1;
    unsigned long FB29 : 1;
    unsigned long FB30 : 1;
    unsigned long FB31 : 1;
} sSTM32F302_CAN_SCE_F11R2;

typedef union {
    sSTM32F302_CAN_SCE_F11R2 Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_F11R2;

#define STM32F302_CAN_SCE_F12R1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long FB0 : 1;
    unsigned long FB1 : 1;
    unsigned long FB2 : 1;
    unsigned long FB3 : 1;
    unsigned long FB4 : 1;
    unsigned long FB5 : 1;
    unsigned long FB6 : 1;
    unsigned long FB7 : 1;
    unsigned long FB8 : 1;
    unsigned long FB9 : 1;
    unsigned long FB10 : 1;
    unsigned long FB11 : 1;
    unsigned long FB12 : 1;
    unsigned long FB13 : 1;
    unsigned long FB14 : 1;
    unsigned long FB15 : 1;
    unsigned long FB16 : 1;
    unsigned long FB17 : 1;
    unsigned long FB18 : 1;
    unsigned long FB19 : 1;
    unsigned long FB20 : 1;
    unsigned long FB21 : 1;
    unsigned long FB22 : 1;
    unsigned long FB23 : 1;
    unsigned long FB24 : 1;
    unsigned long FB25 : 1;
    unsigned long FB26 : 1;
    unsigned long FB27 : 1;
    unsigned long FB28 : 1;
    unsigned long FB29 : 1;
    unsigned long FB30 : 1;
    unsigned long FB31 : 1;
} sSTM32F302_CAN_SCE_F12R1;

typedef union {
    sSTM32F302_CAN_SCE_F12R1 Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_F12R1;

#define STM32F302_CAN_SCE_F12R2_RESET_VALUE 0x00000000
typedef struct {
    unsigned long FB0 : 1;
    unsigned long FB1 : 1;
    unsigned long FB2 : 1;
    unsigned long FB3 : 1;
    unsigned long FB4 : 1;
    unsigned long FB5 : 1;
    unsigned long FB6 : 1;
    unsigned long FB7 : 1;
    unsigned long FB8 : 1;
    unsigned long FB9 : 1;
    unsigned long FB10 : 1;
    unsigned long FB11 : 1;
    unsigned long FB12 : 1;
    unsigned long FB13 : 1;
    unsigned long FB14 : 1;
    unsigned long FB15 : 1;
    unsigned long FB16 : 1;
    unsigned long FB17 : 1;
    unsigned long FB18 : 1;
    unsigned long FB19 : 1;
    unsigned long FB20 : 1;
    unsigned long FB21 : 1;
    unsigned long FB22 : 1;
    unsigned long FB23 : 1;
    unsigned long FB24 : 1;
    unsigned long FB25 : 1;
    unsigned long FB26 : 1;
    unsigned long FB27 : 1;
    unsigned long FB28 : 1;
    unsigned long FB29 : 1;
    unsigned long FB30 : 1;
    unsigned long FB31 : 1;
} sSTM32F302_CAN_SCE_F12R2;

typedef union {
    sSTM32F302_CAN_SCE_F12R2 Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_F12R2;

#define STM32F302_CAN_SCE_F13R1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long FB0 : 1;
    unsigned long FB1 : 1;
    unsigned long FB2 : 1;
    unsigned long FB3 : 1;
    unsigned long FB4 : 1;
    unsigned long FB5 : 1;
    unsigned long FB6 : 1;
    unsigned long FB7 : 1;
    unsigned long FB8 : 1;
    unsigned long FB9 : 1;
    unsigned long FB10 : 1;
    unsigned long FB11 : 1;
    unsigned long FB12 : 1;
    unsigned long FB13 : 1;
    unsigned long FB14 : 1;
    unsigned long FB15 : 1;
    unsigned long FB16 : 1;
    unsigned long FB17 : 1;
    unsigned long FB18 : 1;
    unsigned long FB19 : 1;
    unsigned long FB20 : 1;
    unsigned long FB21 : 1;
    unsigned long FB22 : 1;
    unsigned long FB23 : 1;
    unsigned long FB24 : 1;
    unsigned long FB25 : 1;
    unsigned long FB26 : 1;
    unsigned long FB27 : 1;
    unsigned long FB28 : 1;
    unsigned long FB29 : 1;
    unsigned long FB30 : 1;
    unsigned long FB31 : 1;
} sSTM32F302_CAN_SCE_F13R1;

typedef union {
    sSTM32F302_CAN_SCE_F13R1 Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_F13R1;

#define STM32F302_CAN_SCE_F13R2_RESET_VALUE 0x00000000
typedef struct {
    unsigned long FB0 : 1;
    unsigned long FB1 : 1;
    unsigned long FB2 : 1;
    unsigned long FB3 : 1;
    unsigned long FB4 : 1;
    unsigned long FB5 : 1;
    unsigned long FB6 : 1;
    unsigned long FB7 : 1;
    unsigned long FB8 : 1;
    unsigned long FB9 : 1;
    unsigned long FB10 : 1;
    unsigned long FB11 : 1;
    unsigned long FB12 : 1;
    unsigned long FB13 : 1;
    unsigned long FB14 : 1;
    unsigned long FB15 : 1;
    unsigned long FB16 : 1;
    unsigned long FB17 : 1;
    unsigned long FB18 : 1;
    unsigned long FB19 : 1;
    unsigned long FB20 : 1;
    unsigned long FB21 : 1;
    unsigned long FB22 : 1;
    unsigned long FB23 : 1;
    unsigned long FB24 : 1;
    unsigned long FB25 : 1;
    unsigned long FB26 : 1;
    unsigned long FB27 : 1;
    unsigned long FB28 : 1;
    unsigned long FB29 : 1;
    unsigned long FB30 : 1;
    unsigned long FB31 : 1;
} sSTM32F302_CAN_SCE_F13R2;

