digithings-GmbH/digithingsSTM32F302Sample/SW/DigithingsSTM32F302Sample/EmbSrc/Src/STM32F302_Gen/STM32F302_CAN_SCE_Def.h
typedef union {
    sSTM32F302_CAN_SCE_F25R2 Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_F25R2;

#define STM32F302_CAN_SCE_F26R1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long FB0 : 1;
    unsigned long FB1 : 1;
    unsigned long FB2 : 1;
    unsigned long FB3 : 1;
    unsigned long FB4 : 1;
    unsigned long FB5 : 1;
    unsigned long FB6 : 1;
    unsigned long FB7 : 1;
    unsigned long FB8 : 1;
    unsigned long FB9 : 1;
    unsigned long FB10 : 1;
    unsigned long FB11 : 1;
    unsigned long FB12 : 1;
    unsigned long FB13 : 1;
    unsigned long FB14 : 1;
    unsigned long FB15 : 1;
    unsigned long FB16 : 1;
    unsigned long FB17 : 1;
    unsigned long FB18 : 1;
    unsigned long FB19 : 1;
    unsigned long FB20 : 1;
    unsigned long FB21 : 1;
    unsigned long FB22 : 1;
    unsigned long FB23 : 1;
    unsigned long FB24 : 1;
    unsigned long FB25 : 1;
    unsigned long FB26 : 1;
    unsigned long FB27 : 1;
    unsigned long FB28 : 1;
    unsigned long FB29 : 1;
    unsigned long FB30 : 1;
    unsigned long FB31 : 1;
} sSTM32F302_CAN_SCE_F26R1;

typedef union {
    sSTM32F302_CAN_SCE_F26R1 Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_F26R1;

#define STM32F302_CAN_SCE_F26R2_RESET_VALUE 0x00000000
typedef struct {
    unsigned long FB0 : 1;
    unsigned long FB1 : 1;
    unsigned long FB2 : 1;
    unsigned long FB3 : 1;
    unsigned long FB4 : 1;
    unsigned long FB5 : 1;
    unsigned long FB6 : 1;
    unsigned long FB7 : 1;
    unsigned long FB8 : 1;
    unsigned long FB9 : 1;
    unsigned long FB10 : 1;
    unsigned long FB11 : 1;
    unsigned long FB12 : 1;
    unsigned long FB13 : 1;
    unsigned long FB14 : 1;
    unsigned long FB15 : 1;
    unsigned long FB16 : 1;
    unsigned long FB17 : 1;
    unsigned long FB18 : 1;
    unsigned long FB19 : 1;
    unsigned long FB20 : 1;
    unsigned long FB21 : 1;
    unsigned long FB22 : 1;
    unsigned long FB23 : 1;
    unsigned long FB24 : 1;
    unsigned long FB25 : 1;
    unsigned long FB26 : 1;
    unsigned long FB27 : 1;
    unsigned long FB28 : 1;
    unsigned long FB29 : 1;
    unsigned long FB30 : 1;
    unsigned long FB31 : 1;
} sSTM32F302_CAN_SCE_F26R2;

typedef union {
    sSTM32F302_CAN_SCE_F26R2 Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_F26R2;

#define STM32F302_CAN_SCE_F27R1_RESET_VALUE 0x00000000
typedef struct {
    unsigned long FB0 : 1;
    unsigned long FB1 : 1;
    unsigned long FB2 : 1;
    unsigned long FB3 : 1;
    unsigned long FB4 : 1;
    unsigned long FB5 : 1;
    unsigned long FB6 : 1;
    unsigned long FB7 : 1;
    unsigned long FB8 : 1;
    unsigned long FB9 : 1;
    unsigned long FB10 : 1;
    unsigned long FB11 : 1;
    unsigned long FB12 : 1;
    unsigned long FB13 : 1;
    unsigned long FB14 : 1;
    unsigned long FB15 : 1;
    unsigned long FB16 : 1;
    unsigned long FB17 : 1;
    unsigned long FB18 : 1;
    unsigned long FB19 : 1;
    unsigned long FB20 : 1;
    unsigned long FB21 : 1;
    unsigned long FB22 : 1;
    unsigned long FB23 : 1;
    unsigned long FB24 : 1;
    unsigned long FB25 : 1;
    unsigned long FB26 : 1;
    unsigned long FB27 : 1;
    unsigned long FB28 : 1;
    unsigned long FB29 : 1;
    unsigned long FB30 : 1;
    unsigned long FB31 : 1;
} sSTM32F302_CAN_SCE_F27R1;

typedef union {
    sSTM32F302_CAN_SCE_F27R1 Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_F27R1;

#define STM32F302_CAN_SCE_F27R2_RESET_VALUE 0x00000000
typedef struct {
    unsigned long FB0 : 1;
    unsigned long FB1 : 1;
    unsigned long FB2 : 1;
    unsigned long FB3 : 1;
    unsigned long FB4 : 1;
    unsigned long FB5 : 1;
    unsigned long FB6 : 1;
    unsigned long FB7 : 1;
    unsigned long FB8 : 1;
    unsigned long FB9 : 1;
    unsigned long FB10 : 1;
    unsigned long FB11 : 1;
    unsigned long FB12 : 1;
    unsigned long FB13 : 1;
    unsigned long FB14 : 1;
    unsigned long FB15 : 1;
    unsigned long FB16 : 1;
    unsigned long FB17 : 1;
    unsigned long FB18 : 1;
    unsigned long FB19 : 1;
    unsigned long FB20 : 1;
    unsigned long FB21 : 1;
    unsigned long FB22 : 1;
    unsigned long FB23 : 1;
    unsigned long FB24 : 1;
    unsigned long FB25 : 1;
    unsigned long FB26 : 1;
    unsigned long FB27 : 1;
    unsigned long FB28 : 1;
    unsigned long FB29 : 1;
    unsigned long FB30 : 1;
    unsigned long FB31 : 1;
} sSTM32F302_CAN_SCE_F27R2;

typedef union {
    sSTM32F302_CAN_SCE_F27R2 Bit;
    unsigned long  All;
} uSTM32F302_CAN_SCE_F27R2;

typedef struct {
    uSTM32F302_CAN_SCE_MCR STM32F302_CAN_SCE_MCR; // Offset: 0x0
    uSTM32F302_CAN_SCE_MSR STM32F302_CAN_SCE_MSR; // Offset: 0x4
    uSTM32F302_CAN_SCE_TSR STM32F302_CAN_SCE_TSR; // Offset: 0x8
    uSTM32F302_CAN_SCE_RF0R STM32F302_CAN_SCE_RF0R; // Offset: 0xc
    uSTM32F302_CAN_SCE_RF1R STM32F302_CAN_SCE_RF1R; // Offset: 0x10
    uSTM32F302_CAN_SCE_IER STM32F302_CAN_SCE_IER; // Offset: 0x14
    uSTM32F302_CAN_SCE_ESR STM32F302_CAN_SCE_ESR; // Offset: 0x18
    uSTM32F302_CAN_SCE_BTR STM32F302_CAN_SCE_BTR; // Offset: 0x1c
    unsigned long Reserved0;
    unsigned long Reserved1;
    unsigned long Reserved2;
    unsigned long Reserved3;
    unsigned long Reserved4;
    unsigned long Reserved5;
    unsigned long Reserved6;
    unsigned long Reserved7;
    unsigned long Reserved8;
    unsigned long Reserved9;
    unsigned long Reserved10;
    unsigned long Reserved11;
    unsigned long Reserved12;
    unsigned long Reserved13;
    unsigned long Reserved14;
    unsigned long Reserved15;
    unsigned long Reserved16;
    unsigned long Reserved17;
    unsigned long Reserved18;
    unsigned long Reserved19;
    unsigned long Reserved20;
    unsigned long Reserved21;
    unsigned long Reserved22;
    unsigned long Reserved23;
    unsigned long Reserved24;
    unsigned long Reserved25;
    unsigned long Reserved26;
    unsigned long Reserved27;
    unsigned long Reserved28;
    unsigned long Reserved29;
    unsigned long Reserved30;
    unsigned long Reserved31;
    unsigned long Reserved32;
    unsigned long Reserved33;
    unsigned long Reserved34;
    unsigned long Reserved35;
    unsigned long Reserved36;
    unsigned long Reserved37;
    unsigned long Reserved38;
    unsigned long Reserved39;
    unsigned long Reserved40;
    unsigned long Reserved41;
    unsigned long Reserved42;
    unsigned long Reserved43;
    unsigned long Reserved44;
    unsigned long Reserved45;
    unsigned long Reserved46;
    unsigned long Reserved47;
    unsigned long Reserved48;
    unsigned long Reserved49;
    unsigned long Reserved50;
    unsigned long Reserved51;
    unsigned long Reserved52;
    unsigned long Reserved53;
    unsigned long Reserved54;
    unsigned long Reserved55;
    unsigned long Reserved56;
    unsigned long Reserved57;
    unsigned long Reserved58;
    unsigned long Reserved59;
    unsigned long Reserved60;
    unsigned long Reserved61;
    unsigned long Reserved62;
    unsigned long Reserved63;
    unsigned long Reserved64;
    unsigned long Reserved65;
    unsigned long Reserved66;
    unsigned long Reserved67;
    unsigned long Reserved68;
    unsigned long Reserved69;
    unsigned long Reserved70;
    unsigned long Reserved71;
    unsigned long Reserved72;
    unsigned long Reserved73;
    unsigned long Reserved74;
    unsigned long Reserved75;
    unsigned long Reserved76;
    unsigned long Reserved77;
    unsigned long Reserved78;
    unsigned long Reserved79;
    unsigned long Reserved80;
    unsigned long Reserved81;
    unsigned long Reserved82;
    unsigned long Reserved83;
    unsigned long Reserved84;
    unsigned long Reserved85;
    unsigned long Reserved86;
    unsigned long Reserved87;
    uSTM32F302_CAN_SCE_TI0R STM32F302_CAN_SCE_TI0R; // Offset: 0x180
    uSTM32F302_CAN_SCE_TDT0R STM32F302_CAN_SCE_TDT0R; // Offset: 0x184
    uSTM32F302_CAN_SCE_TDL0R STM32F302_CAN_SCE_TDL0R; // Offset: 0x188
    uSTM32F302_CAN_SCE_TDH0R STM32F302_CAN_SCE_TDH0R; // Offset: 0x18c
    uSTM32F302_CAN_SCE_TI1R STM32F302_CAN_SCE_TI1R; // Offset: 0x190
    uSTM32F302_CAN_SCE_TDT1R STM32F302_CAN_SCE_TDT1R; // Offset: 0x194
    uSTM32F302_CAN_SCE_TDL1R STM32F302_CAN_SCE_TDL1R; // Offset: 0x198
    uSTM32F302_CAN_SCE_TDH1R STM32F302_CAN_SCE_TDH1R; // Offset: 0x19c
    uSTM32F302_CAN_SCE_TI2R STM32F302_CAN_SCE_TI2R; // Offset: 0x1a0
    uSTM32F302_CAN_SCE_TDT2R STM32F302_CAN_SCE_TDT2R; // Offset: 0x1a4
    uSTM32F302_CAN_SCE_TDL2R STM32F302_CAN_SCE_TDL2R; // Offset: 0x1a8
    uSTM32F302_CAN_SCE_TDH2R STM32F302_CAN_SCE_TDH2R; // Offset: 0x1ac
    uSTM32F302_CAN_SCE_RI0R STM32F302_CAN_SCE_RI0R; // Offset: 0x1b0
    uSTM32F302_CAN_SCE_RDT0R STM32F302_CAN_SCE_RDT0R; // Offset: 0x1b4
    uSTM32F302_CAN_SCE_RDL0R STM32F302_CAN_SCE_RDL0R; // Offset: 0x1b8
    uSTM32F302_CAN_SCE_RDH0R STM32F302_CAN_SCE_RDH0R; // Offset: 0x1bc
    uSTM32F302_CAN_SCE_RI1R STM32F302_CAN_SCE_RI1R; // Offset: 0x1c0
    uSTM32F302_CAN_SCE_RDT1R STM32F302_CAN_SCE_RDT1R; // Offset: 0x1c4
    uSTM32F302_CAN_SCE_RDL1R STM32F302_CAN_SCE_RDL1R; // Offset: 0x1c8
    uSTM32F302_CAN_SCE_RDH1R STM32F302_CAN_SCE_RDH1R; // Offset: 0x1cc
    unsigned long Reserved88;
    unsigned long Reserved89;
    unsigned long Reserved90;
    unsigned long Reserved91;
    unsigned long Reserved92;
    unsigned long Reserved93;
    unsigned long Reserved94;
    unsigned long Reserved95;
    unsigned long Reserved96;
    unsigned long Reserved97;
    unsigned long Reserved98;
    unsigned long Reserved99;
    uSTM32F302_CAN_SCE_FMR STM32F302_CAN_SCE_FMR; // Offset: 0x200
    uSTM32F302_CAN_SCE_FM1R STM32F302_CAN_SCE_FM1R; // Offset: 0x204
    unsigned long Reserved100;
    uSTM32F302_CAN_SCE_FS1R STM32F302_CAN_SCE_FS1R; // Offset: 0x20c
    unsigned long Reserved101;
    uSTM32F302_CAN_SCE_FFA1R STM32F302_CAN_SCE_FFA1R; // Offset: 0x214
    unsigned long Reserved102;
    uSTM32F302_CAN_SCE_FA1R STM32F302_CAN_SCE_FA1R; // Offset: 0x21c
    unsigned long Reserved103;
    unsigned long Reserved104;
    unsigned long Reserved105;
    unsigned long Reserved106;
    unsigned long Reserved107;
    unsigned long Reserved108;
    unsigned long Reserved109;
    unsigned long Reserved110;
    uSTM32F302_CAN_SCE_F0R1 STM32F302_CAN_SCE_F0R1; // Offset: 0x240
    uSTM32F302_CAN_SCE_F0R2 STM32F302_CAN_SCE_F0R2; // Offset: 0x244
    uSTM32F302_CAN_SCE_F1R1 STM32F302_CAN_SCE_F1R1; // Offset: 0x248
    uSTM32F302_CAN_SCE_F1R2 STM32F302_CAN_SCE_F1R2; // Offset: 0x24c
    uSTM32F302_CAN_SCE_F2R1 STM32F302_CAN_SCE_F2R1; // Offset: 0x250
    uSTM32F302_CAN_SCE_F2R2 STM32F302_CAN_SCE_F2R2; // Offset: 0x254
    uSTM32F302_CAN_SCE_F3R1 STM32F302_CAN_SCE_F3R1; // Offset: 0x258
    uSTM32F302_CAN_SCE_F3R2 STM32F302_CAN_SCE_F3R2; // Offset: 0x25c
    uSTM32F302_CAN_SCE_F4R1 STM32F302_CAN_SCE_F4R1; // Offset: 0x260
    uSTM32F302_CAN_SCE_F4R2 STM32F302_CAN_SCE_F4R2; // Offset: 0x264
    uSTM32F302_CAN_SCE_F5R1 STM32F302_CAN_SCE_F5R1; // Offset: 0x268
    uSTM32F302_CAN_SCE_F5R2 STM32F302_CAN_SCE_F5R2; // Offset: 0x26c
    uSTM32F302_CAN_SCE_F6R1 STM32F302_CAN_SCE_F6R1; // Offset: 0x270
    uSTM32F302_CAN_SCE_F6R2 STM32F302_CAN_SCE_F6R2; // Offset: 0x274
    uSTM32F302_CAN_SCE_F7R1 STM32F302_CAN_SCE_F7R1; // Offset: 0x278
    uSTM32F302_CAN_SCE_F7R2 STM32F302_CAN_SCE_F7R2; // Offset: 0x27c
    uSTM32F302_CAN_SCE_F8R1 STM32F302_CAN_SCE_F8R1; // Offset: 0x280
    uSTM32F302_CAN_SCE_F8R2 STM32F302_CAN_SCE_F8R2; // Offset: 0x284
    uSTM32F302_CAN_SCE_F9R1 STM32F302_CAN_SCE_F9R1; // Offset: 0x288
    uSTM32F302_CAN_SCE_F9R2 STM32F302_CAN_SCE_F9R2; // Offset: 0x28c
    uSTM32F302_CAN_SCE_F10R1 STM32F302_CAN_SCE_F10R1; // Offset: 0x290
    uSTM32F302_CAN_SCE_F10R2 STM32F302_CAN_SCE_F10R2; // Offset: 0x294
    uSTM32F302_CAN_SCE_F11R1 STM32F302_CAN_SCE_F11R1; // Offset: 0x298
    uSTM32F302_CAN_SCE_F11R2 STM32F302_CAN_SCE_F11R2; // Offset: 0x29c
    uSTM32F302_CAN_SCE_F12R1 STM32F302_CAN_SCE_F12R1; // Offset: 0x2a0
    uSTM32F302_CAN_SCE_F12R2 STM32F302_CAN_SCE_F12R2; // Offset: 0x2a4
    uSTM32F302_CAN_SCE_F13R1 STM32F302_CAN_SCE_F13R1; // Offset: 0x2a8
    uSTM32F302_CAN_SCE_F13R2 STM32F302_CAN_SCE_F13R2; // Offset: 0x2ac
    uSTM32F302_CAN_SCE_F14R1 STM32F302_CAN_SCE_F14R1; // Offset: 0x2b0
    uSTM32F302_CAN_SCE_F14R2 STM32F302_CAN_SCE_F14R2; // Offset: 0x2b4
    uSTM32F302_CAN_SCE_F15R1 STM32F302_CAN_SCE_F15R1; // Offset: 0x2b8
    uSTM32F302_CAN_SCE_F15R2 STM32F302_CAN_SCE_F15R2; // Offset: 0x2bc
    uSTM32F302_CAN_SCE_F16R1 STM32F302_CAN_SCE_F16R1; // Offset: 0x2c0
    uSTM32F302_CAN_SCE_F16R2 STM32F302_CAN_SCE_F16R2; // Offset: 0x2c4
    uSTM32F302_CAN_SCE_F17R1 STM32F302_CAN_SCE_F17R1; // Offset: 0x2c8
    uSTM32F302_CAN_SCE_F17R2 STM32F302_CAN_SCE_F17R2; // Offset: 0x2cc
    uSTM32F302_CAN_SCE_F18R1 STM32F302_CAN_SCE_F18R1; // Offset: 0x2d0
    uSTM32F302_CAN_SCE_F18R2 STM32F302_CAN_SCE_F18R2; // Offset: 0x2d4
    uSTM32F302_CAN_SCE_F19R1 STM32F302_CAN_SCE_F19R1; // Offset: 0x2d8
    uSTM32F302_CAN_SCE_F19R2 STM32F302_CAN_SCE_F19R2; // Offset: 0x2dc
    uSTM32F302_CAN_SCE_F20R1 STM32F302_CAN_SCE_F20R1; // Offset: 0x2e0
    uSTM32F302_CAN_SCE_F20R2 STM32F302_CAN_SCE_F20R2; // Offset: 0x2e4
    uSTM32F302_CAN_SCE_F21R1 STM32F302_CAN_SCE_F21R1; // Offset: 0x2e8
    uSTM32F302_CAN_SCE_F21R2 STM32F302_CAN_SCE_F21R2; // Offset: 0x2ec
    uSTM32F302_CAN_SCE_F22R1 STM32F302_CAN_SCE_F22R1; // Offset: 0x2f0
    uSTM32F302_CAN_SCE_F22R2 STM32F302_CAN_SCE_F22R2; // Offset: 0x2f4
    uSTM32F302_CAN_SCE_F23R1 STM32F302_CAN_SCE_F23R1; // Offset: 0x2f8
    uSTM32F302_CAN_SCE_F23R2 STM32F302_CAN_SCE_F23R2; // Offset: 0x2fc
    uSTM32F302_CAN_SCE_F24R1 STM32F302_CAN_SCE_F24R1; // Offset: 0x300
    uSTM32F302_CAN_SCE_F24R2 STM32F302_CAN_SCE_F24R2; // Offset: 0x304
    uSTM32F302_CAN_SCE_F25R1 STM32F302_CAN_SCE_F25R1; // Offset: 0x308
    uSTM32F302_CAN_SCE_F25R2 STM32F302_CAN_SCE_F25R2; // Offset: 0x30c
    uSTM32F302_CAN_SCE_F26R1 STM32F302_CAN_SCE_F26R1; // Offset: 0x310
    uSTM32F302_CAN_SCE_F26R2 STM32F302_CAN_SCE_F26R2; // Offset: 0x314
    uSTM32F302_CAN_SCE_F27R1 STM32F302_CAN_SCE_F27R1; // Offset: 0x318
    uSTM32F302_CAN_SCE_F27R2 STM32F302_CAN_SCE_F27R2; // Offset: 0x31c
} sSTM32F302_CAN_SCE;

